#+TITLE: Notes about Emacs


*** Hello world

 In insert mode, press TAB with the cursor after <s (so type '<', 's', TAB)
 to quickly create a source code block.  Press 'C-c C-c' while on the code block
 to evaluate the code.
 #+BEGIN_SRC sh
 echo "Hello world it's $(date)"
 #+END_SRC

 #+RESULTS:
 : Hello world it's Wed Jul 18 01:30:54 EDT 2018


**** Just the code
 To control what goes into exported files, do like this
 #+BEGIN_SRC sh :exports code
 echo "Hello world it's $(date)"
 #+END_SRC

 #+RESULTS:
 : Hello world it's Wed Jul 18 01:30:54 EDT 2018

**** Just the results
 Or do like this
 #+BEGIN_SRC sh :exports results
 echo "Hello world it's $(date)"
 #+END_SRC

 #+RESULTS:
 : Hello world it's Wed Jul 18 01:30:54 EDT 2018
**** Both
 Or do like this
 #+BEGIN_SRC sh :exports both
 echo "Hello world it's $(date)"
 #+END_SRC

 #+RESULTS:
 : Hello world it's Wed Jul 18 01:30:54 EDT 2018

*** Editing code in separate buffer : 'C-c ,'
  #+BEGIN_SRC python
  def say_hello(name):
      return "hello " + name
  return say_hello("world")
  #+END_SRC

  #+RESULTS:
  : hello world

*** Tangle
  #+BEGIN_SRC python :tangle test/org-python-test.py
  def say_hello(name):
      return "hello " + name
  return say_hello("world")
  #+END_SRC

  #+RESULTS:
  : hello world



*** Determine version
 full emacs version number. A string.
 #+BEGIN_SRC elisp
 emacs-version
 #+END_SRC

 #+RESULTS:
 : 26.1

 A integer, emacs major version number.
 #+BEGIN_SRC elisp
 emacs-major-version
 #+END_SRC

 A integer, emacs minor version number.
 #+BEGIN_SRC elisp
 emacs-minor-version
 #+END_SRC
** DONE Configuring org-capture and org-mobile and Agenda
   CLOSED: [2018-07-15 Sun 18:07]
   :PROPERTIES:
   :ID:       BC083153-16AD-403B-9747-8BAAD67C2C9E
   :END:
   :LOGBOOK:
   CLOCK: [2018-07-15 Sun 16:25]--[2018-07-15 Sun 18:26] =>  2:01
   :END:

*** Convenience function since first argument is always quoted
#+BEGIN_SRC elisp
(setq nuts '(and bolts))
'nuts
nuts
#+END_SRC

#+RESULTS:
| and | bolts |

